[
     {
          "title_svg": "img/svgs/mwok.svg",
          "siteDescription": "This in-progress, multi-page website is designed to capture the strategic depth and fantasy aesthetic of Mystic Warlords of Ka’a. Built with immersive visuals, smooth navigation, and a thematic layout, it aims to deliver an engaging and intuitive experience for fans of the card game. Once complete, the site will reflect the game's rich lore, competitive energy, and playful complexity.",
          "link": "https://ayatsakalla.github.io/Little-Bird-Toy-Company/",
          "projectImage": "img/projects/404.jpg",
          "projectProblem": "For this site I had to take on the challenge of state management and web sockets",
          "tools": [
               {
                    "name": "node",
                    "toolDescription": "Node.js is a JavaScript runtime that enables server-side functionality. In the Mystic Warlords of Ka’a project, Node is used to handle backend logic, manage routing, and serve dynamic content. It supports features like user authentication and game state management, helping the site respond quickly and reliably to player interactions while keeping the experience smooth and interactive."
               },
               {
                    "name": "JS",
                    "toolDescription":"Vanilla JavaScript is used to handle interactive elements and custom animations throughout the site. In the Mystic Warlords of Ka’a project, it controls features like the trailing blob cursor, hover-based background effects, and scroll-triggered visuals. By working directly with the DOM, it allows for smooth, responsive user interactions and precise visual control without relying on external libraries."
               },
               {
                    "name": "Vue",
                    "toolDescription": "Vue.js is a progressive JavaScript framework used for building responsive, data-driven interfaces. In the Mystic Warlords of Ka’a project, Vue manages dynamic content rendering, user interface state, and component reactivity. It simplifies the structure of the site by organizing interactive elements and enabling seamless updates, helping create a smooth and maintainable front-end experience."
               }
          ]
     },
     {
          "title_svg": "img/svgs/little_bird.svg",
          "siteDescription": "This responsive, multi-page website was built to showcase a handcrafted toy brand with a clean and playful aesthetic. It features smooth navigation, modern layout design, and engaging visuals that reflect the company's whimsical, family-friendly identity. The site delivers a polished and intuitive user experience that highlights the charm and values of the brand.",
          "link": "https://ayatsakalla.github.io/Little-Bird-Toy-Company/",
          "projectImage": "img/projects/little_bird.png",
          "projectProblem": "For this site I had to combine a lot of unfamiliar tools to make the site as smooth and interactive as possible",
          "tools": [
               {
                    "name": "BS",
                    "toolDescription": "Bootstrap is a front-end framework that provides pre-designed components and a responsive system. On the Little Bird Toy Company website, Bootstrap is used to create a mobile-friendly layout with consistent design across devices. It handles much of the styling for the navigation bar, buttons, and layout sections, helping the site remain clean and visually structured without needing extensive custom CSS."
               },
               {
                    "name": "JS",
                    "toolDescription":"Vanilla JavaScript is used to add interactivity and functionality to the site. It controls behaviors such as dropdown menus and dynamic content updates. On the Little Bird Toy Company site, JavaScript used to manage form inputs and basic site logic, make the user experience more interactive and responsive."
               },
               {
                    "name": "jQ",
                    "toolDescription": "jQuery simplifies DOM manipulation and event handling. On this site, it is used for smooth scrolling, simple animations, and handling click events in a concise and readable way. jQuery complements JavaScript by shortening the amount of code needed to achieve interactive features like toggling navigation or showing/hiding content."
               }
          ]
     },
     {
          "title_svg": "img/svgs/tileset.svg",
          "siteDescription": "This clean and responsive web app was built to let users easily split images into customizable grids. With an intuitive interface and instant download feature, it offers a fast, seamless experience perfect for social media and design use.",
          "link": "https://image-splitter-web-app.onrender.com/",
          "projectImage": "img/projects/tileset.png",
          "projectProblem": "I set out to build a fast, user-friendly tool for splitting images into precise sections, focusing on clean UI design and efficient canvas manipulation to streamline the entire process.",
          "tools": [
               {
                    "name": "BS",
                    "toolDescription": "Bootstrap is used to create a responsive, mobile-friendly layout with consistent styling across devices. It handles the grid system, buttons, and form elements, allowing for a clean, modern interface with minimal custom CSS."
               },
               {
                    "name": "JS",
                    "toolDescription":"JavaScript powers the core functionality of the site, handling everything from image processing to dynamic grid generation. It uses the HTML5 Canvas API to slice images into equal parts based on user input and enables instant previews and downloads without needing a backend."
               },
               {
                    "name": "render",
                    "toolDescription": "The site is deployed on Render, which provides a reliable and fast hosting solution with simple Git integration. This setup ensures quick load times, smooth updates, and easy scalability, making the app accessible and performant for users."
               }
          ]
     },
     {
          "title_svg": "img/svgs/rps.svg",
          "siteDescription": "This responsive, single-page site showcases a sleek Rock-Paper-Scissors game with clean design and smooth animations. Built for fun and ease of use, it delivers an engaging, interactive experience across all devices.",
          "link": "https://issac-eligulashvili.github.io/rps/",
          "projectImage": "img/projects/rps.png",
          "projectProblem": "A major challenge was maintaining smooth gameplay, which meant handcrafting each animation frame in Photoshop to ensure a seamless and polished user experience.",
          "tools": [
               {
                    "name": "photoshop",
                    "toolDescription": "Photoshop is a photo editing software which I used to create the animations of the hands for the website. I had to draw them frame by frame, editing the colors of the base image and keeping the rotations constant for each set of images. It got me familiar with the Photoshop tools and Adobe ecosystem."
               },
               {
                    "name": "JS",
                    "toolDescription":"Vanilla JavaScript is used to add interactivity and functionality to the site. It controls behaviors such as the AI you play against. On the Rock, Paper, Scissors site, JavaScript is what enabled the username inputs and drives the animations, playing each frame one by one."
               },
               {
                    "name": "ui",
                    "toolDescription": "Implemented dynamic scene management by conditionally showing and hiding different game views to guide player flow seamlessly. Real-time updates to health indicators provide instant visual feedback, enhancing user engagement and immersion. This approach ensures a smooth, interactive, and responsive gaming experience across devices."
               }
          ]
     },
     {
          "title_svg": "img/svgs/agentselect.svg",
          "siteDescription": "This dynamic, multi-page website was designed for a Valorant esports fantasy league platform with a sleek and competitive aesthetic. It features real-time stats integration, user-friendly team selection, and responsive layouts tailored for both casual fans and esports enthusiasts. The site delivers an engaging and immersive experience that captures the strategic excitement of fantasy gaming within the Valorant community.",
          "link": "https://ayatsakalla.github.io/Little-Bird-Toy-Company/",
          "projectImage": "img/projects/agentselect.png",
          "projectProblem": "I had to integrate my own database, while mangaing to continuously fetch player data from websites and create my own chat system with live updates.",
          "tools": [
               {
                    "name": "react",
                    "toolDescription": "React is a JavaScript library that helped in creating this site and all the live updates it has for both the web and iOS. I used many useStates, and learned the idea of component based development which really sped up the process of creating the website. "
               },
               {
                    "name": "supabase",
                    "toolDescription":"Supabase is the database framework that I decided to use for this app. It taught me how to design databases to maintain efficiency and how to use SQL. I also had to learn how to use liveupdates and ensure that only necessary information is given to not overwhelm user's data."
               },
               {
                    "name": "node",
                    "toolDescription": "NodeJS was the environment that I used to build the backend of the app to connect the React frontend to my Supabase databse. I had to learn how to write GET/POST requests and how to ensure security within my websites. I used many different libraries to build the backend, making me familiar with express and axios."
               }
          ]
     }
]